info.tex
% Created 2020-08-25 Tue 00:52
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[T2A]{fontenc}
\usepackage[a4paper,left=3cm,top=2cm,right=1.5cm,bottom=2cm,marginparsep=7pt,marginparwidth=.6in]{geometry}
\usepackage{cmap}
\usepackage{xcolor}
\usepackage{listings}
\usepackage{polyglossia}
\setdefaultlanguage{russian} \setotherlanguage{english}
\setmainfont{Liberation Serif}
\setsansfont{Liberation Sans}
\setmonofont[Contextuals=Alternate,Ligatures={TeX}]{Fira Code Regular}
\author{Krutko Nikita / KrutNA}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Krutko Nikita / KrutNA},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={Russian}}
\begin{document}

\tableofcontents


\section{Программирование}
\label{sec:orga5b3b3d}

\subsection{1 Семестр}
\label{sec:orgd480777}

Препод: Богатов О.Г., просто душка. 

C++; основы программирования, с нуля.

(От себя могу предлжить почитать \url{https://ravesli.com/uroki-cpp})

Лабораторные: презентации, объяснение материала, тесты.

Практика: программирование на парах. Можно на своём устройстве.

\subsection{2 Семестр}
\label{sec:org7e98bab}

C\#; курсовая работа, проект. Начало ООП (Хз как, учитывая, что это от и до ООП язык).

Пример курсовой: \url{https://github.com/CatDany/NewPogodi}

\section{Физическая культура и спорт (лекции)}
\label{sec:org0cd69b3}

Конспектирование лекций, презентаций. ЗОЖ, упражнения и т.д.

Возможны частные проверки конспектов.

Возможна позже практика.
Секции: 
\begin{itemize}
\item ОФП
\item Спец группа
\item Плавание
\item Тяжёлая атлетика
\item Лёгкая атлетика
\item Футбол, Волейбол
\item Баскетбол
\item Аэробика
\item Борьба
\end{itemize}

\section{Информатика (aka Дискретная математика, см wiki)}
\label{sec:orgf2df3da}

Булева алгебра. Бинаркное представление. Форматы чисел. 

\section{Инженерия и компьютерная графика}
\label{sec:org70a8ff8}

Черчение в Компас 3D, пара программ на C\# (?). Всё по методичке.

\section{Математика}
\label{sec:org94af0ef}

Про преподов ничего не известно. Есть темы за весь курс.

\section{Открытое ПО (ОПО)}
\label{sec:org72dc236}

Linux <3. Установка, терминал. (Астра или любой другой)

(Рекомендую: Mind / Debian / Manjaro / 

\section{Основы проф деятельности (ОПД)}
\label{sec:orgf786093}

Word / Excell / etc.

\section{Физика}
\label{sec:org6678802}

Не особо ебут, средне. Но как повезёт с преподами.
\end{document}